Repository: CofficLab/Cisum_SwiftUI
Catalog: Packages/PluginPlayBack/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hant_hk

source: Play
zh_hans: 播放
zh_hant_hk: 播放

source: Playback engine and playback-state management.
zh_hans: 播放引擎与播放状态管理。
zh_hant_hk: 播放引擎與播放狀態管理。

source: Current File
zh_hans: 当前文件
zh_hant_hk: 目前檔案

source: Playback Engine
zh_hans: 播放引擎
zh_hant_hk: 播放引擎

source: Overview
zh_hans: 概述
zh_hant_hk: 概述

source: Provides a unified playback engine that controls audio playback and restores the last played file after relaunch.
zh_hans: 提供统一的播放引擎，负责音频文件的播放控制，并在重启后恢复上次播放的文件。
zh_hant_hk: 提供統一的播放引擎，負責音訊檔案的播放控制，並在重新啟動後恢復上次播放的檔案。

source: Core Capabilities
zh_hans: 核心能力
zh_hant_hk: 核心能力

source: Playback Engine: drives audio decoding and playback control.
zh_hans: 播放引擎：驱动音频解码与播放控制。
zh_hant_hk: 播放引擎：驅動音訊解碼與播放控制。

source: State record: writes the current playing file to disk.
zh_hans: 状态记录：将当前播放文件写入磁盘。
zh_hant_hk: 狀態記錄：將目前播放的檔案寫入磁碟。

source: Relaunch Resume: restores the last played file after relaunch.
zh_hans: 启动恢复：重启后恢复上次播放的文件。
zh_hant_hk: 啟動恢復：重新啟動後恢復上次播放的檔案。

source: Basic Operations
zh_hans: 基本操作
zh_hant_hk: 基本操作

source: Automatically used whenever music or audiobook content is played.
zh_hans: 播放任意音乐或有声书内容时，自动使用本引擎。
zh_hant_hk: 播放任何音樂或有聲書內容時，會自動使用本引擎。

source: After relaunch, automatically restores the last played file (loaded but not auto-played).
zh_hans: 应用重启后，自动恢复上次播放的文件（仅加载，不自动播放）。
zh_hant_hk: 重新啟動後，自動恢復上次播放的檔案（僅載入，不自動播放）。

source: When the playing file changes, the engine records the latest file for the next resume.
zh_hans: 切换播放文件时，引擎自动记录最新文件用于下次恢复。
zh_hant_hk: 切換播放檔案時，引擎會自動記錄最新檔案以利下次恢復。

source: Notes
zh_hans: 说明
zh_hant_hk: 說明

source: This plugin is a system-level capability that is always enabled and cannot be disabled.
zh_hans: 本插件为系统级能力，始终启用，不可停用。
zh_hant_hk: 此外掛程式為系統層級能力，始終啟用，不可停用。

source: Paused
zh_hans: 已暂停
zh_hant_hk: 已暫停

source: Playing
zh_hans: 播放中
zh_hant_hk: 播放中

source: Recent Playback by Scene
zh_hans: 各场景最近播放
zh_hant_hk: 各場景最近播放

source: Current
zh_hans: 当前
zh_hant_hk: 目前

source: No Record
zh_hans: 无记录
zh_hant_hk: 無記錄

source: Playback Details
zh_hans: 播放详情
zh_hant_hk: 播放詳情

source: File Name
zh_hans: 文件名
zh_hant_hk: 檔案名稱

source: Path
zh_hans: 路径
zh_hant_hk: 路徑

source: Size
zh_hans: 大小
zh_hant_hk: 大小

source: Duration
zh_hans: 时长
zh_hant_hk: 時長

source: Played
zh_hans: 已播放
zh_hant_hk: 已播放

source: Status
zh_hans: 状态
zh_hant_hk: 狀態

source: No file is currently playing
zh_hans: 当前没有播放文件
zh_hant_hk: 目前沒有播放中的檔案

source: Idle
zh_hans: 空闲
zh_hant_hk: 閒置

source: Loading
zh_hans: 加载中
zh_hant_hk: 載入中

source: Ready to Play
zh_hans: 准备播放
zh_hant_hk: 準備播放

source: Stopped
zh_hans: 已停止
zh_hant_hk: 已停止

source: Failed
zh_hans: 失败
zh_hant_hk: 失敗

source: Unknown
zh_hans: 未知
zh_hant_hk: 未知

source: A unified playback engine with playback-state management.
zh_hans: 统一播放引擎与播放状态管理。
zh_hant_hk: 統一的播放引擎與播放狀態管理。

source: Version
zh_hans: 版本
zh_hant_hk: 版本

source: Type
zh_hans: 类型
zh_hant_hk: 類型

source: Plugin
zh_hans: 插件
zh_hant_hk: 外掛程式

source: Drives audio decoding and playback control.
zh_hans: 驱动音频解码与播放控制。
zh_hant_hk: 驅動音訊解碼與播放控制。

source: Restores the last played file after relaunch.
zh_hans: 重启后恢复上次播放的文件。
zh_hant_hk: 重新啟動後恢復上次播放的檔案。

source: Relaunch Resume
zh_hans: 启动恢复
zh_hant_hk: 啟動恢復

source: Records the current playing file to disk.
zh_hans: 记录当前播放文件到磁盘。
zh_hant_hk: 將目前播放的檔案記錄到磁碟。

source: State Persistence
zh_hans: 状态持久化
zh_hant_hk: 狀態持久化
